ИнКар.Маркетплейсы/src/DataProcessors/МП_НастройкаХарактеристикТоваров/МП_НастройкаХарактеристикТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>МП_НастройкаХарактеристикТоваров</name>
</mdclass:DataProcessor>

ИнКар.Маркетплейсы/src/Catalogs/НаборыДополнительныхРеквизитовИСведений/НаборыДополнительныхРеквизитовИСведений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="0a136ad9-22ad-4ba7-a31a-40a193b49d26">
  <name>НаборыДополнительныхРеквизитовИСведений</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <hierarchical>Checked</hierarchical>
  </extension>
  <hierarchical>true</hierarchical>
  <tabularSections extendedConfigurationObject="b456d820-8034-4381-960d-66d9f86b0a4b">
    <name>ДополнительныеРеквизиты</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="bd55fd03-cf67-4333-a554-98e03d18f780">
      <name>Свойство</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ИнКар.Маркетплейсы/src/DataProcessors/МП_НастройкаХарактеристикТоваров/Forms/Форма/Module.bsl
//
//	Филимонов И.В.
//		+7 913 240 81 77
//		
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	// Считывание настроек из хранилища
	ИмяПодсистемы = Метаданные.Подсистемы.МП_Маркетплейсы.Имя;
	КлючНастроек = СтрШаблон("%1ПубликуемыеДопРеквизиты", ИмяПодсистемы);

	УстановитьПривилегированныйРежим(Истина);

	ПубликуемыеДопРеквизиты = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(ИмяПодсистемы,
																			   КлючНастроек,
																			   ,
																			   ,
																			   "ТрубинРВ");

	Если ПубликуемыеДопРеквизиты <> Неопределено Тогда
		Если ТипЗнч(ПубликуемыеДопРеквизиты) = Тип("СписокЗначений") Тогда
			КешРеквизитов = ПубликуемыеДопРеквизиты.ВыгрузитьЗначения();
			ВыбранныеРеквизиты.ЗагрузитьЗначения(КешРеквизитов);
		Иначе
			ВыбранныеРеквизиты.ЗагрузитьЗначения(ПубликуемыеДопРеквизиты);
		КонецЕсли;

	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ПубликуемыеДопРеквизиты", ПубликуемыеДопРеквизиты);
	Запрос.УстановитьПараметр("Родитель",
							  Справочники.НаборыДополнительныхРеквизитовИСведений.НайтиПоНаименованию("Номенклатура",
																									  Истина));
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
				   |	НаборыДопРеквизитов.Свойство КАК Свойство,
				   |	НаборыДопРеквизитов.Свойство.Имя КАК Имя
				   |ИЗ
				   |	Справочник.НаборыДополнительныхРеквизитовИСведений.ДополнительныеРеквизиты КАК НаборыДопРеквизитов
				   |ГДЕ
				   |	НаборыДопРеквизитов.Ссылка В ИЕРАРХИИ (&Родитель)
				   |	И НЕ НаборыДопРеквизитов.Свойство В (&ПубликуемыеДопРеквизиты)
				   |
				   |УПОРЯДОЧИТЬ ПО
				   |	Имя";

	ВсеДопРеквизиты = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Свойство");

	ВсеРеквизиты.ЗагрузитьЗначения(ВсеДопРеквизиты);

	УстановитьПривилегированныйРежим(Ложь);

	ВсеРеквизиты.СортироватьПоЗначению();
	ВыбранныеРеквизиты.СортироватьПоЗначению();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// Код процедур и функций

#КонецОбласти

//#Область ОбработчикиСобытийЭлементовТаблицыФормы//<ИмяТаблицыФормы>
//
//// Код процедур и функций
//
//#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СохранитьИЗакрыть(Команда)
	СохранитьИЗакрытьНаСервере();
	Закрыть();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура СохранитьИЗакрытьНаСервере()

	ИмяПодсистемы = Метаданные.Подсистемы.МП_Маркетплейсы.Имя;
	КлючНастроек = СтрШаблон("%1ПубликуемыеДопРеквизиты", ИмяПодсистемы);

	УстановитьПривилегированныйРежим(Истина);

	НаСохранение = ВыбранныеРеквизиты.ВыгрузитьЗначения();
	ОбщегоНазначения.ХранилищеОбщихНастроекСохранить(ИмяПодсистемы, КлючНастроек, НаСохранение,, "ТрубинРВ");

	УстановитьПривилегированныйРежим(Ложь);

КонецПроцедуры

#КонецОбласти
